#include <stdio.h>
#include <stdlib.h>

int main() {
    void *ptr = NULL;
    size_t n = 1024 * 1024 * 1024;  // Спробуємо виділити великий обсяг пам'яті

    int i = 0;

    while (i++ < 10) {  // цикл, щоб перевірити повторення
        if (!ptr)
            ptr = malloc(n);  // Спробуємо виділити пам'ять

        // Дії з ptr (в даному випадку просто демонстрація)
        printf("Виділено пам'ять на %p\n", ptr);

        // Вільняємо пам'ять, тільки якщо вона була успішно виділена
        free(ptr);
    }

    return 0;
}
